gaotongfont/GT-MindCraft-Embedded/chatbot/ESP32 IDF Project/main/main.c
//                 }
//                 xQueueSend(audio_uri_queue, &receive_evt, portMAX_DELAY);
//                 receive_evt = NULL;
//             } else {
//                 //切换语音识别失败时的ui
//                 gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
//                 ESP_LOGI(TAG,">>1---------------screen_id: %d\n",screen_id);
//                 if ( screen_id == GT_ID_SCREEN_HOME )
//                 {
//                     identification_failed_ui();
//                 } else if ( screen_id == GT_ID_SCREEN_SUBTITLE ){
//                     identifying_failed_ui_in_subtitle();
//                 }
//             }
//         }
//         if (xQueueReceive(mYxQueue2, &received_msg, 1) == pdPASS) {
//             ESP_LOGI(TAG, "mYxQueue2-------------------received_msg = %d\n", received_msg);
//             if (ESP_FAIL == received_msg) {
//                 //切换语音识别失败时的ui
//                 gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
//                 ESP_LOGI(TAG,">>2---------------screen_id: %d\n",screen_id);
//                 if ( screen_id == GT_ID_SCREEN_HOME )
//                 {
//                     identification_failed_ui();
//                 } else if ( screen_id == GT_ID_SCREEN_SUBTITLE ){
//                     identifying_failed_ui_in_subtitle();
//                 }
//             }
//         }
//         gt_task_handler();
//         // vTaskDelay(1);
//     }
// }
// #elif (WEBSOCKET_HTTP_SWITCH == 1) //!USE_HTTP_STREAM
// void gt_gui_task(void *pvParameters)
// {
//     ESP_LOGI(TAG, "--------------------------gt_gui_task\n");
//     int received_msg;
//     while(1){
//         if (xQueueReceive(mYxQueue2, &received_msg, 1) == pdPASS) {
//             ESP_LOGI(TAG, "mYxQueue2-------------------received_msg = %d\n", received_msg);
//             if (ESP_OK == received_msg) {
//                 //启动音频播放器
//                 gt_audio_player_start(cb_data.answer->tts_audio);
//                 //跳转到字幕界面
//                 gt_disp_stack_load_scr_anim(GT_ID_SCREEN_SUBTITLE, GT_SCR_ANIM_TYPE_NONE, 50, 0, true);
//             } else {
//                 //切换语音识别失败时的ui
//                 gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
//                 ESP_LOGI(TAG,">>3---------------screen_id: %d\n",screen_id);
//                 if ( screen_id == GT_ID_SCREEN_HOME )
//                 {
//                     identification_failed_ui();
//                 } else if ( screen_id == GT_ID_SCREEN_SUBTITLE ){
//                     identifying_failed_ui_in_subtitle();
//                 }
//             }
//         }
//         gt_task_handler();
//         // vTaskDelay(1);
//     }
// }

// #elif (WEBSOCKET_HTTP_SWITCH == 2)
// void gt_gui_task(void *pvParameters)
// {
//     ESP_LOGI(TAG, "--------------------------gt_gui_task\n");
//     int received_msg = 0;
//     ReceivedAnswerData* receive_evt = NULL;
//     bool is_first_response = true;
//     while(1){
//         gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
//         if (xQueueReceive(mYxQueue3, &receive_evt, 1) == pdPASS)
//         {
//             if (receive_evt != NULL/*received_msg >= 0 && received_msg < 6*//*ESP_OK == received_msg*/)
//             {
//                 ESP_LOGI(TAG,"receive != NULL  receive_evt = %s", receive_evt->llm_response);
//                 ESP_LOGI(TAG,">>---------------screen_id: %d\n",screen_id);
//                 // if(is_first_response == true)
//                 // {
//                     if (screen_id != GT_ID_SCREEN_SUBTITLE)
//                     {
//                         gt_disp_stack_load_scr_anim(GT_ID_SCREEN_SUBTITLE, GT_SCR_ANIM_TYPE_NONE, 50, 0, true);
//                         is_first_response = false;
//                     }
//                 // }

//                 update_subtitles(receive_evt);
//                 // if(receive_evt != NULL)
//                 // {
//                 //     audio_free(receive_evt);
//                 //     receive_evt = NULL;
//                 //     ESP_LOGI(TAG, "free receive_evt!!!!!!!!!!!!");
//                 // }
//                 audio_free(receive_evt->socket_type);
//                 receive_evt->socket_type = NULL;
//                 // audio_free(receive_evt->tts_audio);
//                 // receive_evt->tts_audio = NULL;
//                 audio_free(receive_evt->emotion_value);
//                 receive_evt->emotion_value = NULL;
//                 audio_free(receive_evt->llm_response);
//                 receive_evt->llm_response = NULL;
//             }
//             else
//             {
//                 //切换语音识别失败时的ui
//                 gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
//                 ESP_LOGI(TAG,">>1---------------screen_id: %d\n",screen_id);
//                 if ( screen_id == GT_ID_SCREEN_HOME )
//                 {
//                     identification_failed_ui();
//                 } else if ( screen_id == GT_ID_SCREEN_SUBTITLE ){
//                     identifying_failed_ui_in_subtitle();
//                 }
//             }
//         }
//         if (xQueueReceive(mYxQueue2, &received_msg, 1) == pdPASS) {
//             ESP_LOGI(TAG, "mYxQueue2-------------------received_msg = %d\n", received_msg);
//             if (ESP_FAIL == received_msg) {
//                 //切换语音识别失败时的ui
//                 gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
//                 ESP_LOGI(TAG,">>2---------------screen_id: %d\n",screen_id);
//                 if ( screen_id == GT_ID_SCREEN_HOME )
//                 {
//                     identification_failed_ui();
//                 } else if ( screen_id == GT_ID_SCREEN_SUBTITLE ){
//                     identifying_failed_ui_in_subtitle();
//                 }
//             }
//         }
//         gt_task_handler();
//     }
// }
// #endif //!USE_HTTP_STREAM

/* ------------------------------------------------------------------------ */
#if (WEBSOCKET_HTTP_SWITCH == 0)
// void gt_streamAudio_task()
// {
//     ESP_LOGI(TAG, "-------------------gt_StreamAudio_task\n");
//     int audio_status = -1;
//     ReceivedAnswerData* receive_evt = NULL;
//     while(1)
//     {
//         audio_status = gt_audio_player_state_get();
//         ESP_LOGI(TAG,"audio_status ============== %d\n",audio_status);
//         if (audio_status != AUDIO_STATUS_RUNNING) {
//             if (audio_uri_queue != NULL && xQueueReceive(audio_uri_queue, &receive_evt, portMAX_DELAY) == pdPASS) {
//                 gt_scr_id_t screen_id = gt_scr_stack_get_current_id();
//                 ESP_LOGI(TAG,">>---------------screen_id: %d\n",screen_id);

//                 if (screen_id == GT_ID_SCREEN_SUBTITLE || screen_id == GT_ID_SCREEN_SETUP)
//                 {
//                     update_subtitles(receive_evt);
//                     // gt_audio_player_start(receive_evt->tts_audio);

//                     audio_free(receive_evt->tts_audio);
//                     receive_evt->tts_audio = NULL;

