gaotongfont/GT-MindCraft-Embedded/chatbot/ESP32 IDF Project/main/main.c
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES) {
        // NVS partition was truncated and needs to be erased
        // Retry nvs_flash_init
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 1, 0))
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
#else
    tcpip_adapter_init();
#endif
    // init audio board
    gt_board_handle = audio_board_init();
    audio_hal_ctrl_codec(gt_board_handle->audio_hal, AUDIO_HAL_CODEC_MODE_BOTH, AUDIO_HAL_CTRL_START);
    audio_hal_set_volume(gt_board_handle->adc_hal, 100);
    // peripheral init
    esp_periph_config_t set_periph_cfg = DEFAULT_ESP_PERIPH_SET_CONFIG();
    set_periph_cfg.extern_stack = true;
    set = esp_periph_set_init(&set_periph_cfg);

#if !USE_HTTP_STREAM || GT_USE_WAKENET
    // sdcard init
#ifdef CONFIG_ESP32_S3_GT_BOARD
    audio_board_sdcard_init(set, SD_MODE_SPI);
#else
    audio_board_sdcard_init(set, SD_MODE_1_LINE);
#endif
#endif //USE_HTTP_STREAM

    xl955_config(&pca_cfg);             /* 初始化扩展IO */
    xl9555_init(&pca_cfg);
    xl9555_set_io_config(LCD_NUM_PWR, 0);
    LCD_PWR(0);

    int font_res = -1;
    spi_init();
    font_res = GT_Font_Init();          /* 初始化字库 */

    spi2_init();
    lcd_init();                         /* 初始化LCD */

    esptim_int_init(1000);              /* 定时器初始化，定时1ms */

    gt_tp_dev = gt_touch_init();        /* 初始化触摸屏 */

#if 0
    gt_audio_player_init();             /* 初始化播放器 */
    gt_audio_player_vol_set(100);
#endif

#if (WEBSOCKET_HTTP_SWITCH == 0)
    gt_pipe_send_init();
#elif (WEBSOCKET_HTTP_SWITCH == 1)
    gt_recording_init();  //初始化录音
#elif (WEBSOCKET_HTTP_SWITCH == 2)
    gt_audio_storage_init();
    gt_pipeline_st* gt_pipeline_obj = gt_pipeline_single();
    gt_pipeline_init(gt_pipeline_obj);
#endif //!USE_HTTP_STREAM

    LCD_PWR(1);

    wifi_init();
    wifi_event_init();

    gt_role_emote_init();           /* 初始化角色表情 */

#if GT_USE_WAKENET
    gt_wakenet_init();
    gt_audio_storage_start(GT_RECORDING_STATE_WAKEUP);   //GT_RECORDING_STATE_WAKEUP
#endif
    /* 设置界面参数 */
    cb_data.settings = (SendSettingsData*)audio_malloc(sizeof(SendSettingsData));
    memset(cb_data.settings, 0, sizeof(SendSettingsData));

    //FUNCT SETTING
    sprintf(cb_data.settings->mode,"%s", "pro");        //专家模式
    sprintf(cb_data.settings->bot_response_style,"%s","normal");
    sprintf(cb_data.settings->emotion_value,"%s","打开");

    cb_data.settings->max_output_size = 50;

    //AI SETTINGS
    sprintf(cb_data.settings->output_format,"%s","mp3");
    sprintf(cb_data.settings->emotion_output,"%s","true");

    sprintf(cb_data.settings->user_name,"%s","海扁王");
    cb_data.settings->user_age = 6;

    gt_ai_bot_role_st default_ai_bot_info =  gt_get_ai_bot_infos("智酱");
    sprintf(cb_data.settings->bot_name,"%s", default_ai_bot_info.name);
    sprintf(cb_data.settings->bot_description,"%s", default_ai_bot_info.character_desc);
    if (strcmp(cb_data.settings->mode, "pro") == 0 || strcmp(cb_data.settings->mode, "pro_character") == 0) {
        sprintf(cb_data.settings->voice_id,"%s",default_ai_bot_info.voice_id);
    } else if (strcmp(cb_data.settings->mode, "standard") == 0 || strcmp(cb_data.settings->mode, "standard_character") == 0) {
        sprintf(cb_data.settings->voice_id,"%s","301000");
    }
    sprintf(cb_data.settings->bot_tone,"%s", default_ai_bot_info.tone);
    memcpy(cb_data.settings->bot_personality, default_ai_bot_info.personality, sizeof(default_ai_bot_info.personality));

    cb_data.answer = (ReceivedAnswerData*)audio_malloc(sizeof(ReceivedAnswerData));
    memset(cb_data.answer, 0, sizeof(ReceivedAnswerData));


    char * mem_pool = (char *)audio_malloc(GT_MEM_SIZE);
    gt_mem_set_pool_pointer(mem_pool);

    
    gt_websocket_client_init(); //websocket client 初始化
    gt_init();                             /* gui初始化 */
    gt_ui_init();                          /* 界面初始化 */
    
 
    
    taskENTER_CRITICAL(&my_spinlock);

#if WEBSOCKET_HTTP_SWITCH == HTTP_STREAM
    xTaskCreate(&http_test_task, "http_test_task", 8*1024, &cb_data, 3, NULL);
    xTaskCreate(gt_streamAudio_task, "gt_streamAudio_task", 3*1024, NULL, 2, NULL);
#elif WEBSOCKET_HTTP_SWITCH == HTTP_NO_STREAM
    xTaskCreate(&http_test_task, "http_test_task", 8*1024, &cb_data, 3, NULL);
#elif WEBSOCKET_HTTP_SWITCH == WEBSOCKET
    xTaskCreate(gt_streamAudio_task, "gt_streamAudio_task", 3*1024, NULL, 5, NULL);

#endif //!USE_HTTP_STREAM

#if MONITOR_WIFI_SIGNAL
    // xTaskCreate(&get_wifi_signal_anytime, "get_wifi_signal_anytime", 3*1024, NULL, 2, NULL);  
#endif

    xTaskCreate(gt_gui_task, "gt_gui_task", 8*1024, NULL, 3, NULL);
    xTaskCreate(gt_wifi_task, "gt_wifi_task", 5*1024, NULL, 5, NULL);

    taskEXIT_CRITICAL(&my_spinlock);
    print_memory_info();

#if (WEBSOCKET_HTTP_SWITCH == 2)
    // serve_dialog_init();
    // gt_websocket_client_init();
#endif


}

void gt_create_room_task()
{
    while(1)
    {

    }
}


void gt_handel_init()
{
    tts_audio_sem = xSemaphoreCreateBinary();
    if(tts_audio_sem == NULL)
    {
        ESP_LOGE(TAG, "Failed to create tts_audio_sem");
        return;
    }

    mYxQueue = xQueueCreate(3, sizeof(int));
    if (mYxQueue == NULL) {
        // 队列创建失败处理
        ESP_LOGE(TAG, "Failed to create queue");
    }
    mYxQueue2 = xQueueCreate(3, sizeof(int));
    if (mYxQueue2 == NULL) {
        // 队列创建失败处理
        ESP_LOGE(TAG, "Failed to create queue");
    }

#if USE_HTTP_STREAM
    mYxQueue3 = xQueueCreate(16, sizeof(ReceivedAnswerData *));
    if (mYxQueue3 == NULL) {
        // 队列创建失败处理
        ESP_LOGE(TAG, "Failed to create queue");
        return;
    }

    audio_uri_queue = xQueueCreate(16, sizeof(char *));
    if (audio_uri_queue == NULL) {
        // 队列创建失败处理
        ESP_LOGE(TAG, "Failed to create audio_uri_queue");
    }
#endif //!USE_HTTP_STREAM
}